In [14]:
import pandas as pd

In [8]:
#two main data types
1. Series (1 dimensional ie only col)
2. Dataframe (2 dimensional ie has row and col)

SyntaxError: invalid syntax (3630877075.py, line 2)

**Syntax for series**

In [13]:
#Example 1
series = pd.Series(['Mango', 'Orange', 'Apple', 'Strawberry'])

In [ ]:
series

In [16]:
#Example 2
animals = pd.Series(['Dog','Cat','Lion','Tiger','Elephant'])
animals

0         Dog
1         Cat
2        Lion
3       Tiger
4    Elephant
dtype: object

**Syntax for data frame**

In [17]:
#Example
cars_data = pd.DataFrame({'Fruits': series, 'Animals': animals})
cars_data

       Fruits   Animals
0       Mango       Dog
1      Orange       Cat
2       Apple      Lion
3  Strawberry     Tiger
4         NaN  Elephant

In [18]:
#import data
car_sales = pd.read_csv("car-sales.csv")

In [19]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [20]:
#exporting a dataframe
car_sales.to_csv("exported car sales.csv", index = False)
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

**Describe data**

In [22]:
#to check data types
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [23]:
car_cols = car_sales.columns
car_cols

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [24]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [26]:
car_sales.describe()
#works only on numeric cols

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [27]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [28]:
car_sales.mean()

C:\Users\admin\AppData\Local\Temp\ipykernel_18496\4073448239.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [29]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [32]:
car_sales["Odometer (KM)"].sum()

786014

In [33]:
car_sales["Doors"].mean()

4.0

In [34]:
#gives no of rows
len(car_sales)

10